app/controllers/list_controller.rb

  def show
  	@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def add_entrant
  	entrant = Entrant.new()
  	entrant.event_id = params[:event_id]
  	entrant.company_id = params[:company_id]
  	entrant.user_id = current_user.id
  	entrant.save
---
INSERT INTO `entrants` (`event_id`, `company_id`, `user_id`, `created_at`, `updated_at`) VALUES (10, 1, 1, '2016-08-06 11:02:34', '2016-08-06 11:02:34')

  def create
    data = upload_params
    @event = Event.new(event_params)
    db_filename = 'images/' + Time.now.strftime('%Y%m%d%H%M%S') + data[:datafile].original_filename
    filename = './public/' + db_filename

    @event.img_path = db_filename
    if @event.save
---
INSERT INTO `events` (`company_id`, `title`, `desc_title`, `desc`, `start`, `end`, `max`, `img_path`, `created_at`, `updated_at`) VALUES (1, 'test', 'test title', 'aaa', '2016-07-30 20:00:00', '2016-07-30 21:00:00', 0, './public/images/20160730202024', '2016-07-30 11:20:24', '2016-07-30 11:20:24')