app/views/list/show.html.erb

SELECT COUNT(*) FROM `entrants` WHERE `entrants`.`event_id` = 1
SELECT `entrants`.* FROM `entrants` WHERE `entrants`.`event_id` = 1
---
                        <td class="col-sm-12" style="font-size:30px;">
                          <%=Entrant.where(event_id: @event.id).size%>/<%=@event.max%>人